app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "created_at", "updated_at", "author", "cost", "publication_date", "publisher", "pages", "release_date") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "updated_at" = $1, "cost" = $2, "pages" = $3 WHERE "books"."id" = $4  [["updated_at", "2024-01-28 20:48:17.343312"], ["cost", "0.0"], ["pages", 150], ["id", 179]]